/*
Вариант 6.
Задача 1. 
-------------------------------------------------------------------------
Вывести нечетные числа в порядке возрастания из массива длиной N.
Пользователь вводит числа в консоль. 
При вводе числа разделены пробелом или символом перехода на новую строку. 
Пользователь может ввести произвольное количество чисел.
Если введено больше чем N символов, то считать необходимо лишь первые N символов.
-------------------
Sample Input 1:
    7
    4 1 6 39 9 2 7
Sample Output 1:
    1 7 9 39
-------------------
Sample Input 2:
    10
    35 70 23 17 93 80 42 23 20 90 42 40 92 18 95
Sample Output 2:
    17 23 23 35 93
-------------------
Sample Input 3:
    50
    20 49 57 99 24 7 72 60 82 91 68 18 49 75 12 57 66 28 48 5
Sample Output 3:
    5 7 49 49 57 57 75 91 99
-------------------
Sample Input 4:
    0
    1 2 3
Sample Output 4:

-------------------
*/

#include <stdio.h>
#include <stdlib.h>

int main() {

    return 0;
}