/*
Вариант 1.
Задача 1. 
-------------------------------------------------------------------------
Считать числа из консоли. Первое из них: N. 
При вводе числа разделены пробелом или символом перехода на новую строку.  
Пользователь может ввести произвольное количество чисел. 
Необходимо найти и вывести N самых больших в порядке их ввода.
-------------------
Sample Input 1:
    3 
    4 1 6 39 9 2 7
Sample Output 1:
    39 9 7
-------------------
Sample Input 2:
    2
    -2 1 -10
Sample Output 2:
-2 1
-------------------
Sample Input 3:
    6
    22 13 29 27
Sample Output 3:
    22 13 29 27
-------------------
Sample Input 4:
    0
    1 2 3
Sample Output 4:

-------------------
*/

#include <stdio.h>
#include <stdlib.h>

int main() {

    return 0;
}