/*
Вариант 5
Задача 1. 
-------------------------------------------------------------------------
Соединить N строк в одну. Длина полученной строки должна быть минимальной.
Пользователь вводит число N и далее (со следующей строки) вводит произвольное (не меньше чем N) количество строк.
Каждая строка не длиннее 100 символов.
-------------------
Sample Input:
    2
    aaa bBb 
    cccc ddd
Sample Output:
    aaa bBb cccc ddd
-------------------
*/

#include <stdio.h>
#include <stdlib.h>

int main() {

    return 0;
}