/*
Вариант 3.
Задача 1. 
-------------------------------------------------------------------------
Вывести в обратном порядке массив из  N чисел.
Пользователь вводит числа в консоль. 
При вводе числа разделены пробелом или символом перехода на новую строку.  
Пользователь может ввести произвольное количество чисел.  
Если введено больше чем N символов, то считать необходимо лишь первые N символов.
Первое введенное пользователем число — N.
-------------------
Sample Input 1:
    7 
    4 1 6 39 9 2 7
Sample Output 1:
    7 2 9 39 6 1 4
-------------------
Sample Input 2:
    10
    99 30 -92 14 70 92 7 12 10 7 -6 5 -23 75 71
Sample Output 2:
    7 10 12 7 92 70 14 -92 30 99
-------------------
Sample Input 3:
    25
    15 -86 29 48 23 12 41 64 51 98 87 82 44 37 31 51 51 25 96 68
Sample Output 3:
    68 96 25 51 51 31 37 44 82 87 98 51 64 41 12 23 48 29 -86 15
-------------------
Sample Input 4:
    0
    1 2 3
Sample Output 4:

-------------------
*/

#include <stdio.h>
#include <stdlib.h>

int main(void) {
    size_t N;
    size_t count = 0;
    int x;
    int *numbers;

    scanf("%ld", &N);
    if (N == 0)
        return 0;

    numbers = (int *) malloc(N * sizeof(int));
    if (numbers == NULL) {
        printf("Allocation error!\n");
        return 1;
    }

    /* Считывание чисел */
    while (scanf("%d", &x) != EOF && count < N)
        numbers[count++] = x;

    /* Распечатка массива в обратном порядке */
    for (size_t i = count; i > 0;)
        printf("%d ", numbers[--i]);
    printf("\n");

    free(numbers);

    return 0;
}
